.artifacts/m3/jset-server-20260717/ab-base-r1-jset-rep1.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12353515 ops, 1274558 (avg: 1235082) ops/sec, 1.28GB/sec (avg: 1.24GB/sec),  1.25 (avg:  1.29) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1235135.56         0.00         0.00         1.29417         1.25500         2.75100         3.85500   1300135.87 
Totals      1235135.56         0.00         0.00         1.29417         1.25500         2.75100         3.85500   2600271.74