.artifacts/m3/jset-server-20260717/ab-base-r1-jset-rep2.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    11098517 ops, 1243768 (avg: 1109603) ops/sec, 1.25GB/sec (avg: 1.11GB/sec),  1.28 (avg:  1.44) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1109491.75         0.00         0.00         1.44057         1.35900         3.48700         4.60700   1167879.89 
Totals      1109491.75         0.00         0.00         1.44057         1.35900         3.48700         4.60700   2335759.78