.artifacts/m3/jset-server-20260717/ab-base-r1-jset-rep3.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12549997 ops, 1278718 (avg: 1254716) ops/sec, 1.28GB/sec (avg: 1.26GB/sec),  1.25 (avg:  1.27) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1254777.96         0.00         0.00         1.27388         1.24700         2.41500         3.64700   1320811.98 
Totals      1254777.96         0.00         0.00         1.27388         1.24700         2.41500         3.64700   2641623.96