.artifacts/m3/jset-server-20260717/ab-base-r1-jset-warm.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12647933 ops, 1262179 (avg: 1264523) ops/sec, 1.27GB/sec (avg: 1.27GB/sec),  1.27 (avg:  1.26) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1264409.19         0.00         0.00         1.26396         1.24700         2.22300         2.95900   1330950.02 
Totals      1264409.19         0.00         0.00         1.26396         1.24700         2.22300         2.95900   2661900.04