.artifacts/m3/jset-server-20260717/ab-base-r1-set-rep1.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    17719540 ops, 1852393 (avg: 1771624) ops/sec, 1.84GB/sec (avg: 1.76GB/sec),  0.86 (avg:  0.90) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1771547.40          ---          ---         0.90174         0.86300         1.79100         2.36700   1844016.65 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1771547.40         0.00         0.00         0.90174         0.86300         1.79100         2.36700   1844016.65