.artifacts/m3/jset-server-20260717/ab-base-r1-set-rep2.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18455260 ops, 1811556 (avg: 1845238) ops/sec, 1.80GB/sec (avg: 1.83GB/sec),  0.88 (avg:  0.87) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1845311.59          ---          ---         0.86562         0.82300         1.67100         2.31900   1920798.23 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1845311.59         0.00         0.00         0.86562         0.82300         1.67100         2.31900   1920798.23