.artifacts/m3/jset-server-20260717/ab-base-r1-set-rep3.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18259212 ops, 1869546 (avg: 1825617) ops/sec, 1.86GB/sec (avg: 1.81GB/sec),  0.85 (avg:  0.87) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1825632.95          ---          ---         0.87501         0.83100         1.78300         2.46300   1900314.63 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1825632.95         0.00         0.00         0.87501         0.83100         1.78300         2.46300   1900314.63