.artifacts/m3/jset-server-20260717/ab-base-r1-set-warm.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18250801 ops, 1839006 (avg: 1824787) ops/sec, 1.83GB/sec (avg: 1.81GB/sec),  0.87 (avg:  0.87) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1824640.34          ---          ---         0.87542         0.83900         1.82300         2.33500   1899281.44 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1824640.34         0.00         0.00         0.87542         0.83900         1.82300         2.33500   1899281.44