.artifacts/m3/jset-server-20260717/ab-base-r2-jset-rep1.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12733963 ops, 1271387 (avg: 1273069) ops/sec, 1.28GB/sec (avg: 1.28GB/sec),  1.26 (avg:  1.25) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1272970.41         0.00         0.00         1.25545         1.19900         2.44700         3.18300   1339961.72 
Totals      1272970.41         0.00         0.00         1.25545         1.19900         2.44700         3.18300   2679923.44