.artifacts/m3/jset-server-20260717/ab-base-r2-jset-rep2.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12755866 ops, 1277028 (avg: 1275247) ops/sec, 1.28GB/sec (avg: 1.28GB/sec),  1.25 (avg:  1.25) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1275194.27         0.00         0.00         1.25339         1.23900         2.01500         2.81500   1342302.72 
Totals      1275194.27         0.00         0.00         1.25339         1.23900         2.01500         2.81500   2684605.44