.artifacts/m3/jset-server-20260717/ab-base-r2-jset-rep3.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12118540 ops, 1274455 (avg: 1211495) ops/sec, 1.28GB/sec (avg: 1.22GB/sec),  1.25 (avg:  1.32) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1211476.36         0.00         0.00         1.31939         1.26300         2.97500         4.12700   1275231.61 
Totals      1211476.36         0.00         0.00         1.31939         1.26300         2.97500         4.12700   2550463.22