.artifacts/m3/jset-server-20260717/ab-base-r2-jset-warm.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    12710737 ops, 1272866 (avg: 1270791) ops/sec, 1.28GB/sec (avg: 1.28GB/sec),  1.25 (avg:  1.26) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.sets   1270836.36         0.00         0.00         1.25779         1.24700         2.11100         3.27900   1337715.51 
Totals      1270836.36         0.00         0.00         1.25779         1.24700         2.11100         3.27900   2675431.03