.artifacts/m3/jset-server-20260717/ab-base-r2-set-rep1.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18700676 ops, 1868531 (avg: 1869778) ops/sec, 1.85GB/sec (avg: 1.86GB/sec),  0.85 (avg:  0.85) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1869616.74          ---          ---         0.85425         0.81500         1.70300         2.25500   1946097.68 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1869616.74         0.00         0.00         0.85425         0.81500         1.70300         2.25500   1946097.68