.artifacts/m3/jset-server-20260717/ab-base-r2-set-rep2.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  10 secs]  0 threads 25 conns:    18588550 ops, 1882418 (avg: 1858569) ops/sec, 1.87GB/sec (avg: 1.84GB/sec),  0.85 (avg:  0.86) msec latency

4         Threads
25        Connections per thread
10        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1858638.83          ---          ---         0.85950         0.80700         1.70300         2.20700   1934670.64 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1858638.83         0.00         0.00         0.85950         0.80700         1.70300         2.20700   1934670.64